tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "spicetify/tap"
brew "antigen"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "libevent"
brew "openssl@1.1"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "dialog"
brew "docker", link: false
brew "docker-compose"
brew "dotdrop"
brew "exercism"
brew "fzf"
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "git"
brew "gradle"
brew "netpbm"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hdf5"
brew "krb5"
brew "libfido2"
brew "node@16"
brew "mongosh"
brew "mysql"
brew "netcat"
brew "nvm"
brew "pnpm"
brew "pup"
brew "python@3.10"
brew "rust"
brew "rustup-init"
brew "speedtest-cli"
brew "thefuck"
brew "tree"
brew "uutils-coreutils"
brew "yarn"
brew "mongodb/brew/mongodb-community"
brew "spicetify/tap/spicetify-cli"
cask "adoptopenjdk11"
cask "background-music"
cask "docker"
cask "iterm2"
cask "linear"
cask "linear-linear"
cask "shottr"
cask "zoom"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chuck94.Xsl-Snippet-Creator"
vscode "DotJoshJohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "icrawl.discord-vscode"
vscode "jebbs.plantuml"
vscode "k--kato.intellij-idea-keybindings"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "ms-vscode.cpptools"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-audio"
vscode "platformio.platformio-ide"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "syler.sass-indented"
vscode "theumletteam.umlet"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "WallabyJs.quokka-vscode"
vscode "WashirePie.vscode-xsl-transform"
vscode "yzhang.markdown-all-in-one"
