tap "adoptopenjdk/openjdk"
tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "spicetify/tap"
tap "withgraphite/tap"
brew "pycparser", link: false
brew "cffi", link: false
brew "cryptography"
brew "ansible"
brew "antigen"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.11"
brew "azure-cli"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "deno"
brew "dialog"
brew "docker", link: false
brew "docker-compose"
brew "dotdrop"
brew "exercism"
brew "fzf"
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "git"
brew "git-lfs"
brew "glab"
brew "openjdk"
brew "gradle"
brew "netpbm"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hdf5"
brew "krb5"
brew "libfido2"
brew "llvm"
brew "maven"
brew "mongosh"
brew "mysql"
brew "netcat"
brew "node@16"
brew "nvm"
brew "openjdk@17"
brew "openssl@1.1"
brew "pandoc"
brew "pnpm"
brew "poetry"
brew "pup"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-tk@3.11"
brew "python-tk@3.9"
brew "python@3.10"
brew "rust"
brew "rustup-init"
brew "speedtest-cli"
brew "thefuck"
brew "tree"
brew "uutils-coreutils"
brew "virtualenv"
brew "yarn"
brew "azure/functions/azure-functions-core-tools@4"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "spicetify/tap/spicetify-cli"
brew "withgraphite/tap/graphite"
cask "background-music"
cask "docker"
cask "iterm2"
cask "linear"
cask "linear-linear"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "raycast"
cask "shottr"
cask "zoom"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chuck94.xsl-snippet-creator"
vscode "denoland.vscode-deno"
vscode "dotjoshjohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "hhawkins.azurefunctionssnippets"
vscode "icrawl.discord-vscode"
vscode "jebbs.plantuml"
vscode "jirkavrba.subway-surfers"
vscode "k--kato.intellij-idea-keybindings"
vscode "kakumei.ts-debug"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "platformio.platformio-ide"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "theumletteam.umlet"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "washirepie.vscode-xsl-transform"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
